app/controllers/frontpage_controller.rb

SELECT  "users".* FROM "users" WHERE (Langauge = :langauge and Population > :population)  ORDER BY "users"."id" ASC LIMIT 1
---
	def Booking
		# puts @@LocationInfo
		@data = @@LocationInfo
		@Destination = User.where("Langauge = :langauge and Population > :population", {langauge:"English", population: 50000}).first